Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewportCantContainEmptyView
Sheet views cannot contain empty view "%1!s!".

Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewOnASheetMustBeUniqueWarn
Sheet views cannot contain more than one instance of "%1!s!."

Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewOnASheetMustBeUnique
Sheet views cannot contain more than one instance of "%1!s!."

Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewOnASheetCannotBeUncropped3DPerspectiveView
Sheets do not support uncropped perspective views.

Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewInAModelMustBeUniqueWarn
Sheet views in this model cannot contain more than one instance of "%1!s!."

Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewInAModelMustBeUnique
Sheet views in this model cannot contain more than one instance of "%1!s!."

Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures
Failures about placing viewports on sheets.